Revit 2024 API
PolyLine Members
The PolyLine type exposes the following members.
Methods
Name | Description
Clone
Returns a copy of this polyline.
Create
Creates a polyline with coordinate points provided.
Dispose
Causes the object to release immediately any resources it may be utilizing.
 (Inherited from APIObject.)
Equals
 Determines whether the specified Object is equal to the current Object.
 (Inherited from GeometryObject.)
Evaluate
Evaluates a parameter on the polyline.
GetCoordinate
Gets the coordinate point of the specified index.
GetCoordinates
Gets the coordinate points of the polyline.
GetHashCode
 Gets the integer value of the geometry object as hash code
 (Inherited from GeometryObject.)
GetOutline
Gets the outline of the polyline.
GetTransformed
Gets the copy of the polyline which is applied the specified transformation.
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
Properties
Name | Description
GraphicsStyleId
The ElementId of the GeometryObject's GraphicsStyle
 (Inherited from GeometryObject.)
Id
A unique integer identifying the GeometryObject in its associated non view-specific GeometryElement.
 (Inherited from GeometryObject.)
IsElementGeometry
Indicates whether this geometry is obtained directly from an Element.
 (Inherited from GeometryObject.)
IsReadOnly
Identifies if the object is read-only or modifiable.
 (Inherited from APIObject.)
NumberOfCoordinates
Gets the number of the coordinate points.
Visibility
The visibility.
 (Inherited from GeometryObject.)
See Also
PolyLine Class
Autodesk.Revit.DB Namespace